<template lang="pug">
	LitestWarpper
		.global-article
			h1 Web-анимация

			h2 Общие заметки по теории анимации
			h3 Микровзаимодействия
			ul
				li сайт можно рассматривать как набор статичных состояний, анимацию - как средство их, состояний, объединения (состояния плавно переходят одно в другое, делая сайт бесшовным и помогая пользователю понять, какие новые элементы интерфейса появились и откуда, а куда ушли старые)
				li микровзаимодействие - элемент взаимодействия пользователя с интерфейсом (клики, ховеры, ввод, валидация, ожидание загрузки и т.д.)
				li цель анимации в микровзаимодействиях - сгладить переход при смене состояний интерфейса и управлять вниманием пользователя. Элемент интерфейса должен восприниматься как единое целое
				li большую роль играет временной интервал, интерфейc не должен "рассыпаться"
				li оптимальная длительность большинства анимаций от 0.35s до 1.5s, при этом на основную часть анимации должно приходиться максимум 0.5s, остальное - доводка
					= ' '
					a(href="https://uxdesign.cc/the-ultimate-guide-to-proper-use-of-animation-in-ux-10bd98614fa9") (полезный гайд по длительности анимации)

			h2 Теория анимации
			h3 12 принципов анимации
			ul
				li
					strong 1. Сжатие и растяжение (Squash and stretch)
					= ' '
					| - иллюзия эластичности, веса, скорости и прочих физических свойств объекта (быстрое движение - удлиннение, торможение - сплющивание, лёгкий и эластичный объект, такой, как резиновый шарик, искажается гораздо сильнее, чем тяжёлый металлический шар)
				li
					strong 2. Подготовка или упреждение (Anticipation)
					= ' '
					| -  небольшой разгон/отступ в противоположную сторону перед началом движения
				li
					strong 3. Сценичность
					= ' '
					| - привлечение внимания при помощи анимации в область экрана с самой высокой важностью, отсутствие перегруженности анимацией
				li
					strong 4. Компоновки и фазированные движения
					= ' '
					| - Компоновки (отрисовка ключевых кадров и добавление переходов между ними, используется для создания четкого понимания начального и конечного значения анимации, напр., движение от т.А к т.Б) и фазованные движения (последовательная отрисовка кадров от начала до конца, используется в процессах, напр., горение огня)
				li
					strong 5. Доводка и захлест (overlapping)
					= ' '
					| - эффект инерции. Физический объект не может начать двигаться/остановиться моментально. Скорость достигает максимума к середине. Если движение останавливается резко, то нужно создать эффект гашения кинетической энергии
				li
					strong 6. Движение по дуге
					= ' '
					| -  в реальном мире объекты никогда не двигаются по идеальной прямой
				li
					strong 7. Выразительная деталь
					= ' '
					| -  усиление основного действия дополнительным (напр., мимика при покачивании головой)
				li
					strong 8. Тайминг
					= ' '
					| -  одна и та же анимация с разными скоростями может сообщать разные физические свойства и передавать разное настроение
				li
					strong 9. Утрирование
					= ' '
					| - чаще преувеличение черт используется в мультипликации, однако и в интерфейсах прецвеличение филических свойств может дать хороший UX
				li
					strong 10. Профессиональный рисунок
					= ' '
					| - учет мелочей, деталей, сохранения физических свойств, освещение, обводки
				li
					strong 11. Харизматичность
					= ' '
					| - внимание к деталям и атмосфера
				li
					strong 12. Смягчение начала и окончания движения
					= ' '
					| - плавные разгон и торможение, инерция, частота кадров в начале и конце анимации выше, чем в середине (напр., временные функции ease-* в CSS)

</template>

<script lang="ts">
import Vue from 'vue';
import Component from 'vue-class-component';
import LitestWarpper from '~/components/litest/wrapper.vue';

@Component({ components: { LitestWarpper	} })
export default class Animation extends Vue {}
</script>

<style lang="scss" scoped>
@import "../../assets/style/globals-litest.scss";
</style>
